




// Exam_05_04 Удаление повторов
// Уровень: 3
// Темы: Динамические массивы

// Напишите программу, которая удаляет повторяющиеся элементы из последовательности неотрицательных целых чисел. Последовательность указана в стандартном
// входном потоке stdin, элементы последовательности разделены пробелами, конец последовательности равен числу -1, которое обозначает конецпоследовательности
// и не является ее элементом. Выведите элементы результирующей последовательности, разделенные пробелом, в стандартный выходной поток stdout. 
// В конце ответа не должно быть перехода на новую строку. Проверьте правильность введенных данных. В случае какой-либо ошибки выведите "n/a".

// *Примечание:* Порядок элементов в результирующей последовательности должен соответствовать порядку первых вхождений соответствующих чисел
// в исходной последовательности.

// Размер последовательности может быть любым

// Входные данные             Выходные данные
// 1 1 2 2 3 -1                1 2 3
// 1 2 1 3 1 4 -1              1 2 3 4
// -1