// Exam_06_05 Квадраты чисел по спирали

// Уровень: 5
// Темы: Матрицы

// Напишите программу, которая заполняет квадратную матрицу N x N по спирали, против часовой стрелки, начиная с левого верхнего угла квадратами чисел
// от 0 до N^2 - 1. Порядок проведения матрица N указана в стандартном входном потоке stdin как положительное ненулевое число.
// Выведите результирующую матрицу в стандартный поток вывода stdout в виде таблицы (после каждой выведенной строки результирующей матрицы
// необходимо выполнить разрыв строки), элементы должны быть разделены пробелами, и перед новыми строками не должно быть пробелов. В конце ответа не должно быть
// перехода на новую строку.
// Проверьте правильность введенных данных. В случае какой-либо ошибки выведите "n/a".

// Входные данные             Выходные данные
//  ------                      ------
// 2                            0 9
//                              1 4

// 3                            0 49 36
//                              1 64 25
//                              4 9 16


// *Внимание:* Убедительно напоминаем вам, что процедура тестирования вашей программы включает в себя анализ стиля кода.
// Пожалуйста, загляните в папку "материалы /". Кроме того, обязательно проверьте вашу программу на наличие утечек памяти!