// Exam_06_01 Умножение квадратных матриц

// Уровень: 4
// Темы: Матрицы

// Написать программу, производящую умножение двух квадратных матриц 'A' и 'B' размера 'N'. Размерность 'N' задается на стандартном потоке ввода stdin, после чего
// следует 'N^2' целых чисел, описывающих построчно матрицу 'A' и 'N^2' целых чисел описывающих построчно матрицу 'B'. Результат умножения матриц 'C = A * B' вывести
// на стандартный поток вывода stdout в виде таблицы (после каждой выведенной строки матрицы 'C' должен быть осуществлен перенос строки), элементы должны быть
// разделены пробелами, а перед переносом строк не должно быть пробельных символов.
// В конце ответа не должно быть переноса на новую строку.
// Проверить на валдность введенные данные. В случае любой ошибки выводить "n/a". 

// Входные данные             Выходные данные
// 2
// 1 2                          19 22
// 3 4                          43 50

// 5 6
// 7 8
