// Exam_06_03 Вращение матрицы

// Уровень: 4
// Темы: Матрицы 

// Создайте программу, которая поворачивает матрицу размером 'M * N' на 90 градусов по часовой стрелке. Размер матрицы задается в стандартном входном
// потоке stdin в виде двух положительных чисел, за которыми следуют 'M * N' целых чисел, описывающих строку матрицы с помощью ряд. Результат работы программы
// должен быть выведен в стандартный поток вывода stdout в виде таблицы (после каждой выходной строки конечной матрицы должен быть разрыв строки).
// Элементы должны быть разделены пробелами, и перед разрывом строки не должно быть пробелов. В конце ответа не должно быть перехода на новую строку. 

// Проверьте правильность введенных данных. В случае какой-либо ошибки выведите "n/a".

// Входные данные                Выходные данные
// 2 3                             4 1
// 1 2 3                           5 2
// 4 5 6                           6 3


// 3 3
// 1 2 3                           7 4 1                           
// 4 5 6                           8 5 2
// 7 8 9                           9 6 3
