// Exam_06_04 Спиральная матрица

// Уровень: 6
// Темы: Матрицы

// Написать программу, осуществляющую заполнение квадратной матрицы порядка 'N' по спирали по часовой стрелке начиная с верхнего левого угла
// числами от '1' до 'N^2'. Порядок матрицы 'N' задается на стандартном потоке ввода stdin в виде положительного ненулевого числа.
// Полученную матрицу вывести на стандартный поток вывода stdout в виде таблицы (после каждой выведенной строки результирующей матрицы должен быть
// осуществлен перенос строки), элементы должны быть разделены пробелами, а перед переносом строк не должно быть пробельных символов. 
// В конце ответа не должно быть переноса на новую строку.

// Проверить на валидность введенные данные. В случае любой ошибки выводить "n/a".

// Входные данные              Выходные данные
// 2                             1 2
//                               4 3

// 3                             1 2 3
//                               8 9 4
//                               7 6 5

